from sanskrit_tts import default_tts


def test_default_tts():
    text = """तैत्तिरीयोपनिषत् प्रसिद्धासु दशसु उपनिषत्सु अन्यतमा । इयं कृष्णयजुर्वेदीयतैत्तिरीयशाखान्तर्गता । 
    इयम् उपनिषत् वल्लीत्रयेण विभक्ता विद्यते । प्रथमा वल्ली वर्णोच्चारविषयकः इत्यतः शिक्षावल्ली इति निर्दिश्यते । द्वितीयायां वल्ल्याम् आनन्दस्य मीमांसा विद्यते इत्यतः ब्रह्मानन्दवल्ली इति निर्दिश्यते । तृतीयायां वल्ल्यां वरुणस्य पुत्रः भृगुः प्रश्नोत्तरैः तपसा ब्रह्मज्ञानं प्राप्तवान् इत्यतः भृगुवल्ली इति निर्दिश्यते ।"""
    TTS = default_tts()
    audio = TTS.synthesize(text)
    audio.export("test.mp3")


if __name__ == "__main__":
    test_default_tts()